const quizData = [
    {
        "question": "Российский и советский конструктор стрелкового оружия. Доктор технических наук, генерал-лейтенант, создатель всемирно известного автомата, изображение которого стало частью государственной символики нескольких стран.",
        "options": [
            "Калашников М.Т.",
            "Стечкин И.Я.",
            "Дегтярев В.В."
        ],
        "score": 1,
        "right_answer": "Калашников М.Т.",
        "description": "Михаил Калашников. Разработчик легендарного автомата АК ('Автомат Калашникова') калибра 7,62 мм, поступившего в Советскую армию в 1949 году. Он занесен в Книгу рекордов Гиннесса как самое распространенное оружие в мире (по некоторым данным, всего насчитывается более 100 млн автоматов). Это дешевое, неприхотливое и простое в использовании оружие в прямом смысле слова изменило и покорило мир."
    },
    {
        "question": "Как назывался первый пилотируемый космический корабль, созданный под руководством Сергея Королёва?",
        "options": [
            "Восход",
            "Восток",
            "Союз"
        ],
        "score": 1,
        "right_answer": "Восток",
        "description": "На корабле «Восток» 12 апреля 1961 года лётчик-космонавт СССР майор ВВС коммунист Юрий Алексеевич Гагарин совершил первый в мире пилотируемый полёт в космическое пространство."
    },
    {
        "question": "Великий русский ученый - физиолог, академик, создатель науки о высшей нервной деятельности; лауреат Нобелевской премии по физиологии или медицине 1904 года «за работу по физиологии пищеварения».",
        "options": [
            "Бурденко Н.Н.",
            "Павлов И.П.",
            "Преображенский М.Я."
        ],
        "score": 1,
        "right_answer": "Павлов И.П.",
        "description": "Иван Павлов - доктор медицины. Создатель науки о высшей нервной деятельности и формировании рефлекторных дуг; основатель крупнейшей российской физиологической школы. Первый русский нобелевский лауреат."
    },
    {
        "question": "Этот советский футболист стал единственным вратарем в истории, получившим «Золотой мяч».",
        "options": [
            "Владислав Третьяк",
            "Лев Яшин",
            "Эдуард Стрельцов"
        ],
        "score": 1,
        "right_answer": "Лев Яшин",
        "description": "Лев Яшин произвел настоящую революцию во вратарском ремесле. За свою карьеру он отразил более 150 пенальти, а его «сейвы» и сегодня показывают молодым вратарям. Премия лучшему вратарю мира названа его именем."
    },
    {
        "question": "Этот советский режиссер привнес науку в актерское мастерство.",
        "options": [
            "Мейерхольд В.Э.",
            "Станиславский К.С.",
            "Немирович-Данченко В.И."
        ],
        "score": 1,
        "right_answer": "Станиславский К.С.",
        "description": "Константин Станиславский вошел в историю как великий реформатор театра, актер, режиссер, руководитель, теоретик и педагог. Создатель знаменитой актерской системы, популярной во всем мире."
    },
    {
        "question": "Русский биолог и селекционер, автор многих сортов плодово-ягодных культур, доктор биологии.",
        "options": [
            "Пржевальский М.Н.",
            "Вавилов Н.И.",
            "Мичурин И.В."
        ],
        "score": 1,
        "right_answer": "Мичурин И.В.",
        "description": "Иван Мичурин вывел свыше 150 новых гибридных сортов, среди которых яблони, груши, вишни, сливы, черешня и другие плодово-ягодные растения и цветы."
    },
    {
        "question": "Какое открытие прославило врача-офтальмолога Святослава Фёдорова?",
        "options": [
            "Он создал один из лучших искусственных хрусталиков в мире",
            "Он провел первую успешную микрооперацию глаза по собственному методу",
            "Он провел исследования зрительного нерва и влияние патологий нервной системы на зрение"
        ],
        "score": 1,
        "right_answer": "Он создал один из лучших искусственных хрусталиков в мире",
        "description": "Святослав Федоров первым в мире сделал операцию по лечению глаукомы на ранних стадиях (1973 год), открыв тем самым новое направление в науке. В России им и его учениками проведено около 1,5 млн. таких операций."
    }
]